YY-Edwards/LTE-STM32-USART_IO/main.c
/**
  ******************************************************************************
  * @file    keysanf_usart/main.c 
  * @author  EDWARDS
  * @version V1.0.0
  * @date    05/03/2017
  * @brief   Main program body
  ******************************************************************************
  * @copy
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2010 STMicroelectronics</center></h2>
  */ 

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"
#include "platform_config.h"

/** @addtogroup STM32F10x_StdPeriph_Examples
  * @{
  */
    
PUTCHAR_PROTOTYPE
{
    USART_SendData(USART1, ch);
    while (USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET)
    {}
    return ch;
}

int simple_uart_put(u8 ch)
{
    USART_SendData(USART1, ch);
    while (USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET)
    {}
    return ch;
}

/** @addtogroup USART_Interrupt
  * @{
  */ 

/* Private typedef -----------------------------------------------------------*/
//typedef enum { FAILED = 0, PASSED = !FAILED} TestStatus;

typedef enum key_states_e{  
    KEY_NOT_PRESS,  //初始状态，未按下
    KEY_PRESSED,  //按下
    KEY_RELEASE,   //释放
}KeyStatus_t; 

/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
#define countof(a)   (sizeof(a) / sizeof(*(a)))

/* Private variables ---------------------------------------------------------*/


static u8  fac_us=0;//us微秒延时倍乘数
static u16 fac_ms=0;//ms毫秒延时倍乘数


//列如按下键为key0,则短按键值为0xA0, 长按键值为0xB0,释放键值为0xC0
volatile u8 press_counter = 0;
volatile u8 time_out = 0;
static volatile u16 current_key_value = 0x99;//当前按键值
static volatile u16 last_key_value = 0x99;//上次按键值

static volatile u16 pressed_value =0x99;//按下后返回的键值（包括短按长按）
static volatile u16 release_value =0x99;//释放返回的键值

//static KeyStatus_t KeyStatus = KEY_NOT_PRESS;

volatile u16 key1_pressed_flag = 0;//key1
volatile u16 key2_pressed_flag = 0;//key2
volatile u16 key3_pressed_flag = 0;//key3
volatile u16 key4_pressed_flag = 0;//key4
volatile u16 key5_pressed_flag = 0;//key5
volatile u16 key6_pressed_flag = 0;//key6
volatile u16 key7_pressed_flag = 0;//key7
volatile u16 key8_pressed_flag = 0;//key8

 NVIC_InitTypeDef NVIC_InitStructure;
 USART_InitTypeDef USART_InitStructure;

/* Private function prototypes -----------------------------------------------*/
void USART2_Init(void);
void USART1_Init(void);
void KEY_Init(void);
void NVIC_Configuration(void);
void EXTI_USER_Init(void);
void TIM3_Int_Init(u16 arr,u16 psc);
void delay_init(void);
void delay_ms(u16 xms);
void delay_us(u32 xus);

//TestStatus Buffercmp(uint8_t* pBuffer1, uint8_t* pBuffer2, uint16_t BufferLength);

/* Private functions ---------------------------------------------------------*/

/**
  * @brief   Main program
  * @param  None
  * @retval None
  */
int main(void)
{
  /*!< At this stage the microcontroller clock setting is already configured, 
       this is done through SystemInit() function which is called from startup
       file (startup_stm32f10x_xx.s) before to branch to application main.
       To reconfigure the default setting of SystemInit() function, refer to
       system_stm32f10x.c file
     */     
  //int counter =0;
 //u16 ReadVale =0x00;
  delay_init();	    	 //延时函数初始化	

  NVIC_Configuration();//设置中断优先级分组
  
  KEY_Init();//初始化按键的IO模式
  
  EXTI_USER_Init();//外部中断初始化，在这里初始化8个对应按键的中断输入
  
  USART1_Init();//串口1初始化,带打印调试
  
  //USART2_Init();
    
  //TIM3_Int_Init(100-1, 7199);//定时器3初始化,10Khz的计数频率，计数到100为10ms  
  
  GPIO_SetBits(GPIO_LED, DS1_PIN|DS2_PIN|DS3_PIN|DS4_PIN);/*关闭所有的LED指示灯*/
  
  //printf("\r\n/***********************key scan start*********************/\r\n");
  while(1)
  {     
      delay_ms(100); 
      GPIO_ResetBits(GPIO_LED, DS1_PIN);
      delay_ms(200); 
      GPIO_SetBits(GPIO_LED, DS1_PIN);
//      delay_ms(300); 
//      GPIO_ResetBits(GPIO_LED, DS1_PIN);
//      delay_ms(400); 
//      GPIO_SetBits(GPIO_LED, DS1_PIN);
            
  }
        
    
    
    /******
//    switch(KeyStatus)
//    {
//      case KEY_NOT_PRESS:
//        
//        //有键值被按下
//        if(key1_pressed_flag | key2_pressed_flag |key3_pressed_flag |key4_pressed_flag
//           | key5_pressed_flag |key6_pressed_flag  |key7_pressed_flag |key8_pressed_flag)
//        {
//          
//          if(key1_pressed_flag)
//            current_key_value = 0x01;
//          else if(key2_pressed_flag)
//            current_key_value = 0x02;
//          else if(key3_pressed_flag)
//            current_key_value = 0x03;
//          else if(key4_pressed_flag)
//            current_key_value = 0x04;
//          else if(key5_pressed_flag)
//            current_key_value = 0x05;
//          else if(key6_pressed_flag)
//            current_key_value = 0x06;
//          else if(key7_pressed_flag)
//            current_key_value = 0x07;
//          else if(key8_pressed_flag)
//            current_key_value = 0x08;
//          else
//          {
//            
//            printf("key_pressed_flag err !!!\n");
//            KeyStatus = KEY_NOT_PRESS;
//            break;
//          }
//          KeyStatus = KEY_PRESSED;
//          TIM_Cmd(TIM3, ENABLE);  //开启TIM3
//           
//        }
//          
//        break;
//        
//    case KEY_PRESSED:
//      
//          switch(current_key_value)
//          {
//            case 0x01: 
//              if(press_counter > 40)//超过400ms
//                pressed_value = 0xB1;//长按的键值
//              else
//                pressed_value = 0xA1;//短按的键值
//              //等待按键释放
//              if(!key1_pressed_flag) KeyStatus = KEY_RELEASE;
//       
//              break;
//              
//            case 0x02: 
//               if(press_counter > 40)
//                pressed_value = 0xB2;
//              else
//                pressed_value = 0xA2;
//              if(!key2_pressed_flag) KeyStatus = KEY_RELEASE;
//              
//              break;
//            case 0x03: 
//               if(press_counter > 40)
//                pressed_value = 0xB3;
//              else
//                pressed_value = 0xA3;
//              if(!key3_pressed_flag) KeyStatus = KEY_RELEASE;
//              
//              break;
//            case 0x04:
//               if(press_counter > 40)
//                pressed_value = 0xB4;
//              else
//                pressed_value = 0xA4;
//              if(!key4_pressed_flag) KeyStatus = KEY_RELEASE;
//              
//              break;
//            case 0x05: 
//               if(press_counter > 40)
//                pressed_value = 0xB5;
//              else
//                pressed_value = 0xA5;
//              if(!key5_pressed_flag) KeyStatus = KEY_RELEASE;
//             
//              break;
//          
//            case 0x06: 
//               if(press_counter > 40)
//                pressed_value = 0xB6;
//              else
//                pressed_value = 0xA6;
//              if(!key6_pressed_flag) KeyStatus = KEY_RELEASE;
//              break;
//              
//            case 0x07:
//               if(press_counter > 40)
//                pressed_value = 0xB7;
//              else
//                pressed_value = 0xA7;
//              if(!key7_pressed_flag) KeyStatus = KEY_RELEASE;
//              
//              break;
//              
//            case 0x08: 
//               if(press_counter > 40)
//                pressed_value = 0xB8;
//              else
//                pressed_value = 0xA8;
//              if(!key8_pressed_flag) KeyStatus = KEY_RELEASE;              
//              break;
//              
//            default:
//               printf("current_key_value err !!!\n");
//              KeyStatus = KEY_NOT_PRESS;
//              break;
//          
//          }
//          
//          if(KeyStatus == KEY_RELEASE)
//          {
//            TIM_Cmd(TIM3, DISABLE);  //关闭TIM3
//            press_counter = 0;//清空计数
//          }
//          
//        break;
//                
//      case KEY_RELEASE:
//        
//         switch(pressed_value)
//          {
//            case 0xA1:
//            case 0xB1:
//             release_value = 0xC1; 
//              break;
//              
//            case 0xA2:
//            case 0xB2:
//             release_value = 0xC2; 
//              break;
//              
//            case 0xA3:
//            case 0xB3:
//             release_value = 0xC3; 
//              break;
//              
//            case 0xA4:
//            case 0xB4:
//             release_value = 0xC4; 
//              break;
//              
//            case 0xA5:
//            case 0xB5:
//             release_value = 0xC5; 
//              break;
//              
//            case 0xA6:
//            case 0xB6:
//             release_value = 0xC6; 
//              break;
//              
//            case 0xA7:
//            case 0xB7:
//             release_value = 0xC7; 
//              break;
//              
//            case 0xA8:
//            case 0xB8:
//             release_value = 0xC8; 
//              break;
//                
//            default:
//               printf("pressed_value err !!!\n");
//              KeyStatus = KEY_PRESSED;
//              break;
//          
//          }
// 
//        
//        KeyStatus = KEY_NOT_PRESS;
//        
//        break;
//        
//        
//      default:
//        printf("key status err !!!\n");
//        KeyStatus = KEY_NOT_PRESS;
//        break;
//     
//    
//    }
//    //delay_ms(1);
//    
 

   
    delay_ms(10);
    if((release_value !=0x99) && (pressed_value !=0x99))
    {

      last_key_value = pressed_value;
      printf("pressed_value : 0x%X\r\n", pressed_value);
      counter++;
      printf("release_value : 0x%X, %d\r\n", release_value, counter);
      
