YY-Edwards/LTE-STM32-USART_IO/main.c
}

/**
  * @brief  Compares two buffers.
  * @param  pBuffer1, pBuffer2: buffers to be compared.
  * @param  BufferLength: buffer's length
  * @retval PASSED: pBuffer1 identical to pBuffer2
  *   FAILED: pBuffer1 differs from pBuffer2
  */
//TestStatus Buffercmp(uint8_t* pBuffer1, uint8_t* pBuffer2, uint16_t BufferLength)
//{
//  while(BufferLength--)
//  {
//    if(*pBuffer1 != *pBuffer2)
//    {
//      return FAILED;
//    }
//
//    pBuffer1++;
//    pBuffer2++;
//  }
//
//  return PASSED;
//}

#ifdef  USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif

void delay_init()	 
{

  SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK_Div8);	//此处选择外部时钟，HCLK/8
  fac_us = SystemCoreClock/8000000;//fac_us定义为系统时钟的1/8	
  fac_ms = (u16)fac_us*1000; //每个ms需要的systick时钟数

}

void delay_us(u32 xus)	//延时xus个微秒
{		
    u32 temp;	    	 
    SysTick->LOAD=xus*fac_us;                         //时间加载	  		 
    SysTick->VAL=0x00;                                //清空计数器
    SysTick->CTRL|=SysTick_CTRL_ENABLE_Msk ;       //设置开始倒数计时的掩码

    do
    {
            temp=SysTick->CTRL;
    }
    while(temp&0x01&&!(temp&(1<<16)));            //等待时间到达  
            SysTick->CTRL&=~SysTick_CTRL_ENABLE_Msk;       //关闭计数器

    SysTick->VAL =0X00;                            //清空计数器	 
}

//延时xms 72mhz下，xms<=1864
void delay_ms(u16 xms)
{	 		  	  
    u32 temp;		   
    SysTick->LOAD=(u32)xms*fac_ms; //时间加载
    SysTick->VAL =0x00;            //清空计数器
    SysTick->CTRL|=SysTick_CTRL_ENABLE_Msk ;          //开始倒数 
    do
    {
            temp=SysTick->CTRL;
    }
    while(temp&0x01&&!(temp&(1<<16)));//等待时间到达哦
    SysTick->CTRL&=~SysTick_CTRL_ENABLE_Msk;       //关闭计数器
    SysTick->VAL =0X00;       //清空计数器  	    
} 
/**
  * @}
  */ 

/**
  * @}
  */ 

/******************* (C) COPYRIGHT 2010 STMicroelectronics *****END OF FILE****/
